Repository: zgat/ZIME
Catalog: resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Selection effect
zh_hans: 选中效果

source: Full-row highlight
zh_hans: 整行变色

source: Underline
zh_hans: 下划线

source: Window corners
zh_hans: 窗口角形

source: Rounded
zh_hans: 圆角

source: Square
zh_hans: 直角

source: Themes change colors only. Full-row highlighting follows the window corners.
zh_hans: 主题只改变颜色。整行选中背景与窗口保持相同角形。

source: Clear Blue
zh_hans: 澄蓝

source: Soft Gray
zh_hans: 雾灰

source: Update channel
zh_hans: 更新频道

source: Stable
zh_hans: 正式版

source: Preview
zh_hans: 预览版

source: Preview receives release candidates before they become the latest stable version.
zh_hans: 预览版会在候选版本成为最新正式版前收到更新。

source: Installed language data is newer than this update channel. No downgrade will be downloaded.
zh_hans: 已安装的语言数据领先于此更新频道，不会下载旧版本。

source: iCloud Drive sync
zh_hans: iCloud Drive 同步

source: Sync learned words with iCloud Drive
zh_hans: 通过 iCloud Drive 同步学习词

source: Location
zh_hans: 位置

source: iCloud Drive is unavailable. Check iCloud Drive in System Settings.
zh_hans: iCloud Drive 当前不可用，请在系统设置中检查 iCloud Drive。

source: Linnet always uses iCloud Drive/Linnet; no folder selection is required.
zh_hans: Linnet 固定使用 iCloud Drive/Linnet，无需选择文件夹。

source: Rime incrementally merges learned Chinese and English words between your Macs. Linnet checks at most once per hour while it is running; the next activation catches up. It does not read or merge the user dictionary format itself.
zh_hans: Rime 会在多台 Mac 之间增量合并中英文学习词。Linnet 运行时每小时最多检查一次；下次启用输入法时会自动补上。Linnet 自身不会读取或合并用户词典格式。

source: Recovery backups also include personal words, disabled words, and Text Expander data. The first upload creates a baseline; later uploads are incremental and manual.
zh_hans: 恢复备份还包括个人词、停用词和文本扩展数据。首次上传建立基线；之后手动上传增量备份。

source: The first upload creates a full recovery baseline. Later uploads add an immutable delta only. Local data is not changed.
zh_hans: 首次上传建立完整恢复基线，之后只添加不可变的增量数据。本地数据不会改变。

source: Update language data, sync or move personal data, and review backups and diagnostics.
zh_hans: 更新语言数据、同步或迁移个人数据，并查看备份与诊断。

source: Upload Recovery Backup
zh_hans: 上传恢复备份

source: Sync Learning Now
zh_hans: 立即同步学习词

source: Upload Incremental Backup…
zh_hans: 上传增量备份…

source: Review Recovery Backup…
zh_hans: 审阅恢复备份…

source: Upload an incremental recovery backup?
zh_hans: 上传增量恢复备份？

source: Repair cloud recovery backup?
zh_hans: 修复云端恢复备份？

source: Create Full Repair Backup
zh_hans: 创建完整修复备份

source: The existing incremental recovery chain cannot be verified. This creates a new complete baseline; previous cloud objects are left unchanged.
zh_hans: 现有增量恢复链无法通过校验。此操作会创建新的完整基线，保留此前的云端文件。

source: Repair language data with complete packs?
zh_hans: 下载完整词包以修复语言数据？

source: Download Complete Changed Packs
zh_hans: 下载有变化的完整词包

source: The differential update could not finish. Installed data is unchanged. Retry later, or confirm a full download of changed packs. Unchanged packs and personal data are kept.
zh_hans: 差分更新未能完成，已安装的数据未改变。可稍后重试，或确认下载有变化的完整词包；不变词包和个人数据会保留。

source: Checking detected legacy data…
zh_hans: 正在检查检测到的旧数据…

source: Checking personal dictionary…
zh_hans: 正在检查个人词典…

source: Compatible legacy data was verified.
zh_hans: 已验证兼容的旧数据。

source: Detected legacy data could not be verified.
zh_hans: 无法验证检测到的旧数据。

source: Keep My Drafts
zh_hans: 保留我的草稿

source: Loading backups…
zh_hans: 正在载入备份…

source: Settings data changed elsewhere
zh_hans: 设置数据已在其他位置更改

source: Reload Current Data
zh_hans: 重新载入当前数据

source: Your unsaved drafts were preserved. Reload the current settings data, or keep your drafts and review them before applying.
zh_hans: 未保存的草稿已保留。请重新载入当前设置数据，或保留草稿并在应用前检查。

# deploy_failure
source: Error occurred. Please check log files
zh_hans: 有错误！请查看日志

# deploy_start
source: Deploying Rime input method engine.
zh_hans: 部署输入法引擎…

# deploy_success
source: Deployment complete.
zh_hans: 部署完成。

source: Data
zh_hans: 数据

source: Data & Updates
zh_hans: 数据与更新

source: Language data updates
zh_hans: 语言数据更新

source: Manual recovery & transfer
zh_hans: 手动恢复与迁移

source: Recovery history
zh_hans: 恢复历史

source: These recovery points are created before data-changing transactions; they are not automatic full backups.
zh_hans: 这些恢复点会在数据变更事务前创建；它们并不是自动完整备份。

source: Full backup archives are created only when you choose a backup or export button.
zh_hans: 只有在你主动选择备份或导出按钮时，才会创建完整备份归档。

source: Review updates, sync or move personal data, and manage recovery.
zh_hans: 查看更新、同步或迁移个人数据，并管理恢复选项。

source: Core update
zh_hans: 核心更新

source: Advanced version details
zh_hans: 高级版本详情

source: Source revision
zh_hans: 源代码修订

source: Switch away from Linnet before applying an installed Core update.
zh_hans: 应用已安装的核心更新前，请先切换到其他输入法。

source: Switch away from Linnet before applying the installed Core update.
zh_hans: 请先切换到其他输入法，再应用已安装的核心更新。

source: The installed Core update is being applied.
zh_hans: 正在应用已安装的核心更新。

source: Installed Core will run after the next normal login or restart.
zh_hans: 已安装的核心将在下次正常登录或重启后运行。

source: No installed Core update is waiting to be applied.
zh_hans: 当前没有等待应用的核心更新。

source: Update language data, move personal data, and review backups and diagnostics.
zh_hans: 更新语言数据、迁移个人数据，并查看备份和诊断信息。

source: Appearance
zh_hans: 外观

source: Choose a candidate-window theme and refine it before typing.
zh_hans: 选择并细调候选窗口主题。

source: Theme, font, and appearance mode update here and in the next candidate window. Candidate count and layout require Apply Changes.
zh_hans: 主题、字体与明暗模式会立即显示在这里，并同步到下一次出现的候选窗口；候选数与布局需点按“应用更改”。

source: Candidate count is applied with the schema after you press Apply Changes.
zh_hans: 每页候选数会在按下“应用更改”后随输入方案一起生效。

source: Candidate appearance is live.
zh_hans: 候选窗口外观已实时生效。

source: Appearance mode
zh_hans: 明暗模式

source: Candidates and IPA share the Latin face; Chinese candidates and definitions share the Chinese face. All presets use built-in macOS fonts.
zh_hans: 候选词与音标共用西文字体，中文候选与释义共用中文字体；所有预设均使用 macOS 原生字体。

source: Clay
zh_hans: 陶印

source: Mist
zh_hans: 雾青

source: Glass
zh_hans: 原生玻璃

source: Dark
zh_hans: 深色

source: Light
zh_hans: 浅色

source: Xuan
zh_hans: 宣纸

source: Moon
zh_hans: 月华

source: Ink
zh_hans: 墨朱

source: Slate
zh_hans: 青岩

source: System
zh_hans: 跟随系统

source: System Default
zh_hans: 系统默认

source: Selected automatically by macOS
zh_hans: 由 macOS 自动选择

source: System follows the active text window when macOS exposes its appearance; otherwise it follows the macOS appearance.
zh_hans: macOS 提供外观信息时会跟随当前输入窗口；否则跟随 macOS 外观。

source: The local candidate preview is unavailable because its bundled theme data could not be read.
zh_hans: 本地候选预览不可用，因为内置主题数据无法读取。

source: The preview and candidate window use this theme. Settings keeps the native macOS appearance.
zh_hans: 预览与候选窗口使用此主题；设置窗口保持 macOS 原生外观。

source: Theme
zh_hans: 主题风格

source: Each theme includes paired Light and Dark appearances.
zh_hans: 每套主题均包含相配的浅色与深色外观。

source: Choose this candidate-window theme.
zh_hans: 选择这套候选窗口主题。

source: Selected
zh_hans: 已选择

source: Not selected
zh_hans: 未选择

source: Typeface
zh_hans: 中英文字体

source: Apply Changes
zh_hans: 应用更改

source: Apply your changes before closing?
zh_hans: 关闭前要应用更改吗？

source: Discard Changes
zh_hans: 丢弃更改

source: Keep Editing
zh_hans: 继续编辑

source: Input, English, candidate layout, and personal-data changes are not active until you apply them.
zh_hans: 输入、英文、候选布局和个人数据更改只有在应用后才会生效。

source: Theme, font, and appearance mode save and apply to the candidate window live. Candidate count, candidate layouts, Input, English, and personal data require Apply Changes.
zh_hans: 主题、字体和明暗模式会实时保存并应用到候选窗口；候选数、候选布局、输入、英文和个人数据需点按“应用更改”。

source: Application
zh_hans: 应用程序

source: Automatic backups
zh_hans: 自动备份

source: Cancel
zh_hans: 取消

source: Cancel Download
zh_hans: 取消下载

source: Candidate
zh_hans: 候选项

source: Candidate font size
zh_hans: 候选字体大小

source: 12–32 pt. The local visual preview updates immediately; the live candidate window follows the appearance setting.
zh_hans: 12–32 磅。本地视觉预览会立即更新；真实候选窗口会跟随外观设置。

source: Candidate window
zh_hans: 候选窗口

source: Input mode
zh_hans: 输入模式

source: Input changes are pending. Choose Apply Changes before testing them.
zh_hans: 输入更改尚待应用；请先点按“应用更改”再测试。

source: Example
zh_hans: 示例

source: The example follows the selected Chinese scheme and trigger key.
zh_hans: 示例会随所选中文方案与触发键变化。

source: Candidates per page
zh_hans: 每页候选数

source: Expanded
zh_hans: 已展开

source: Collapsed
zh_hans: 已收起

source: Capitalize sentence starts
zh_hans: 句首自动大写

source: Chinese and English…
zh_hans: 中文和英文…

source: Chinese candidates
zh_hans: 中文候选

source: Chinese and English keep independent horizontal or vertical layouts. Layout changes take effect after Apply Changes.
zh_hans: 中文和英文分别保存横排或竖排方向。布局更改会在点按“应用更改”后生效。

source: Chinese options
zh_hans: 中文选项

source: Chinese…
zh_hans: 中文…

source: Clear Learning
zh_hans: 清除学习数据

source: Commit current candidate
zh_hans: 上屏当前候选

source: Data management
zh_hans: 数据管理

source: Download source
zh_hans: 下载来源

source: GitHub (Direct)
zh_hans: GitHub（直连）

source: GH-Proxy Public Mirror (Third-party)
zh_hans: GH-Proxy 公共镜像（第三方）

source: Custom Mirror…
zh_hans: 自定义镜像…

source: Custom mirror base URL
zh_hans: 自定义镜像根地址

source: Enter the HTTPS root address provided by a GHProxy-compatible service.
zh_hans: 请输入兼容 GHProxy 的服务提供的 HTTPS 根地址。

source: Use Custom Mirror
zh_hans: 使用自定义镜像

source: Enter a compatible HTTPS mirror root address.
zh_hans: 请输入兼容的 HTTPS 镜像根地址。

source: Use Custom Mirror to make this address active before downloading.
zh_hans: 下载前，请点按“使用自定义镜像”以启用该地址。

source: GH-Proxy is an independent third-party service and is not operated by Linnet or GitHub.
zh_hans: GH-Proxy 是独立的第三方服务，不由 Linnet 或 GitHub 运营。

source: Mirrors are third-party services that can see your IP address, request time, and requested public file URLs. Linnet never sends them your dictionaries, learning data, credentials, or other personal data.
zh_hans: 镜像是第三方服务，可以看到你的 IP 地址、请求时间和所请求的公开文件地址。Linnet 不会向其发送你的词典、学习数据、凭据或其他个人数据。

source: Open GH-Proxy Service Information
zh_hans: 打开 GH-Proxy 服务说明

source: This built-in mirror is unavailable. Choose another source before updating.
zh_hans: 此内置镜像已不可用。更新前请选择其他下载来源。

source: GitHub Direct is the default. Choose a mirror only when direct downloads are unreliable.
zh_hans: 默认使用 GitHub 直连。仅在直连下载不稳定时选择镜像。

source: The selected source is used only for future language-data downloads. Linnet never switches or falls back to another source automatically.
zh_hans: 所选来源仅用于之后的语言数据下载；Linnet 不会自动切换或回退到其他来源。

source: Linnet verifies every downloaded release pack before activation.
zh_hans: Linnet 会在启用前验证每个下载的发布包。

source: Choose and save a valid download source before checking for updates.
zh_hans: 检查更新前，请选择并保存有效的下载来源。

source: Data services are unavailable.
zh_hans: 数据服务当前不可用。

source: Diagnostics
zh_hans: 诊断

source: Dictionary
zh_hans: 词典

source: Keep personal words, exclusions, and text expansions in one place.
zh_hans: 集中管理个人词语、停用词和文本扩展。

source: Disabled English words
zh_hans: 停用的英文词

source: English
zh_hans: 英文

source: Tune completion, pronunciation, translation, and correction together.
zh_hans: 统一调整补全、发音、翻译和纠错。

source: Candidate suggestions
zh_hans: 候选建议

source: Typing behavior
zh_hans: 输入行为

source: English…
zh_hans: 英文…

source: Follow System
zh_hans: 跟随系统

source: Horizontal
zh_hans: 横排

source: Input
zh_hans: 输入

source: Configure Chinese and Smart English behavior in one place.
zh_hans: 在一处配置中文与智能英文输入行为。

source: Chinese Input
zh_hans: 中文输入

source: Configure input behavior. Choose your Chinese scheme and reverse-lookup preferences here.
zh_hans: 在这里配置中文方案、输入行为与拼音反查偏好。

source: Chinese scheme
zh_hans: 中文方案

source: Natural Code
zh_hans: 自然码双拼

source: Full Pinyin
zh_hans: 全拼

source: Flypy Double Pinyin
zh_hans: 小鹤双拼

source: Microsoft Double Pinyin
zh_hans: 微软双拼

source: Sogou Double Pinyin
zh_hans: 搜狗双拼

source: Intelligent ABC
zh_hans: 智能 ABC 双拼

source: Ziguang Double Pinyin
zh_hans: 紫光双拼

source: Jiajia Pinyin
zh_hans: 拼音加加双拼

source: The selected scheme is used for Chinese input and prefixed pinyin-to-English lookup in Chinese mode.
zh_hans: 所选方案用于中文输入，也用于中文模式下带前缀的拼音反查英文。

source: Type the selected key before the chosen scheme's code in Chinese mode.
zh_hans: 在中文模式下，请先输入所选触发键，再输入当前方案的编码。

source: Smart English recognizes the selected full- or double-pinyin scheme automatically; semicolon and other punctuation go directly to the current app.
zh_hans: 智能英文会自动识别所选的全拼或双拼方案；分号及其他标点会直接输入当前应用。

source: Language
zh_hans: 界面语言

source: Current candidate preview
zh_hans: 当前候选预览

source: Import Existing
zh_hans: 导入现有数据

source: Import and Replace
zh_hans: 导入并替换

source: Import existing Rime / Hallelujah data?
zh_hans: 导入现有 Rime / Hallelujah 数据？

source: Mode switching
zh_hans: 模式切换

source: Tap Shift to switch between Chinese and Smart English. Caps Lock remains the explicit raw ASCII mode.
zh_hans: 轻按 Shift 在中文与智能英文之间切换；Caps Lock 保留为明确的原始 ASCII 模式。

source: The menu-bar label comes from Rime: 双 or 中 for Chinese, A for raw ASCII, and En for Smart English.
zh_hans: 菜单栏标签直接来自 Rime：中文显示“双”或“中”，原始 ASCII 显示“A”，智能英文显示“En”。

source: Next candidate page
zh_hans: 下一页候选

source: Page %1$ld, candidate %2$ld
zh_hans: 第 %1$ld 页，第 %2$ld 个候选

source: Output traditional Chinese by default
zh_hans: 默认输出繁体中文

source: Personal dictionary
zh_hans: 个人词典

source: Pinyin reverse lookup
zh_hans: 拼音反查

source: Reverse lookup trigger
zh_hans: 反查触发键

source: Semicolon (;)
zh_hans: 分号（;）

source: Vertical bar (|)
zh_hans: 竖线（|）

source: Publishing candidate appearance…
zh_hans: 正在发布候选窗口外观…

source: Previous candidate page
zh_hans: 上一页候选

source: Replace categories from this portable archive?
zh_hans: 用此便携归档替换所选数据类别？

source: Restore Backup
zh_hans: 恢复备份

source: Restore this verified backup?
zh_hans: 恢复此已验证备份？

source: Local candidate appearance preview unavailable
zh_hans: 本地候选外观预览不可用

source: Candidate window preview
zh_hans: 候选窗口预览

source: Preview unavailable
zh_hans: 预览不可用

source: Preview unavailable. The bundled theme data is missing or invalid.
zh_hans: 预览不可用。内置主题数据缺失或无效。

source: Show Chinese definitions
zh_hans: 显示中文释义

source: Show Smart English context suggestions
zh_hans: 显示智能英文上下文联想

source: Show IPA pronunciation
zh_hans: 显示 IPA 音标

source: Smart English
zh_hans: 智能英文

source: Data release is the pack's increasing content sequence, not a Git revision. The version identifies the corresponding published content.
zh_hans: 数据发布序号是词库包随内容递增的编号，不是 Git 修订号；版本号标识对应的已发布内容。

source: Data release
zh_hans: 数据发布序号

source: Language-data updates are available. No logout is required.
zh_hans: 有可用的语言数据更新，无需注销。

source: Not installed
zh_hans: 未安装

source: Current
zh_hans: 当前

source: Available
zh_hans: 可更新至

source: Suggest emoji candidates
zh_hans: 提供 Emoji 候选

source: Prefer single characters in auxiliary-code lookup by default
zh_hans: 辅助码查询默认优先单字

source: These options are applied from Settings to each new input session; no keyboard shortcut changes them.
zh_hans: 这些选项由设置应用到每个新输入会话；没有键盘快捷键会临时更改它们。

source: Candidate shortcuts
zh_hans: 候选快捷键

source: Switch source / translation
zh_hans: 切换原文／译文

source: Confirm current candidate
zh_hans: 选择当前候选上屏

source: Smart completion
zh_hans: 智能补全

source: Smart completion fills the selected English suggestion into marked input. Confirm to insert; completion never switches translation sides.
zh_hans: 智能补全将选中的英文建议填入待输入内容，确认后才上屏；它不会切换原文／译文。

source: Press shortcut…
zh_hans: 请按下快捷键…

source: Not assigned
zh_hans: 未设置

source: Reset candidate shortcuts
zh_hans: 恢复默认快捷键

source: Click, then press a shortcut. Escape cancels; Delete clears optional shortcuts.
zh_hans: 点击后按下快捷键。Esc 取消；Delete 可清除智能补全的快捷键。

source: Use Tab, Return, Space, a function key, or a modified key. Editing and system shortcuts are reserved.
zh_hans: 请使用 Tab、Enter、空格、功能键或组合键；编辑键与系统保留快捷键不可占用。

source: This shortcut is already assigned to another candidate action.
zh_hans: 此快捷键已用于另一个候选动作，请换一个。

source: Click a shortcut and press the keys you want. The confirm shortcut accepts the current row on either side; number keys 1–9 select the corresponding row.
zh_hans: 点击快捷键后直接按键录入。原文和译文共用同一个上屏快捷键；数字 1–9 选择对应候选。

source: Text Expander
zh_hans: 文本扩展

source: Use English punctuation by default
zh_hans: 默认使用英文标点

source: Clear selected learning data?
zh_hans: 清除所选学习数据？

source: Add
zh_hans: 添加

source: Apply Changes is revision-checked and creates an automatic backup.
zh_hans: 应用更改时会校验版本并自动创建备份。

source: Chinese learning
zh_hans: 中文学习数据

source: Chinese sentence model
zh_hans: 中文语法模型

source: Copy Report
zh_hans: 复制报告

source: Custom words
zh_hans: 自定义词语

source: Diagnostics have not been collected.
zh_hans: 尚未收集诊断信息。

source: Disabled words
zh_hans: 停用词

source: English learning
zh_hans: 英文学习数据

source: English words learned in Chinese mode
zh_hans: 中文模式内的英文学习

source: Chinese mode learns Chinese and English candidates together. Smart English keeps separate learning history.
zh_hans: 中文模式中的中英文候选一起学习排序；独立英文模式使用另一套学习记录。

source: This switch affects Smart English only. Chinese-mode candidates follow the Chinese learning strategy.
zh_hans: 此开关仅影响独立英文模式。中文模式中的中英文候选均遵循中文学习策略。

source: Learn from English selections
zh_hans: 学习英文选词

source: Add a trailing space when Space accepts a candidate
zh_hans: 按空格键上屏候选时附加空格

source: English candidates
zh_hans: 英文候选

source: Existing Rime / Hallelujah data
zh_hans: 现有 Rime / Hallelujah 数据

source: Expansion
zh_hans: 扩展内容

source: Export…
zh_hans: 导出…

source: Import…
zh_hans: 导入…

source: Keep latest 10 verified backups
zh_hans: 保留最近 10 个已验证备份

source: Keep latest 30 verified backups
zh_hans: 保留最近 30 个已验证备份

source: Keep latest 100 verified backups
zh_hans: 保留最近 100 个已验证备份

source: Language data
zh_hans: 语言数据

source: Chinese data
zh_hans: 中文数据

source: English data
zh_hans: 英文数据

source: Chinese grammar model
zh_hans: 中文语法模型

source: Long-tail data
zh_hans: 长尾数据

source: Data status
zh_hans: 数据状态

source: Core status
zh_hans: 核心状态

source: Installation needs repair
zh_hans: 安装需要修复

source: Run the Complete installer to restore the installed Core identity.
zh_hans: 请运行完整安装包以恢复已安装核心的身份信息。

source: Complete offline
zh_hans: 完整离线数据

source: Recommended
zh_hans: 推荐数据

source: Unavailable
zh_hans: 不可用

source: Model data missing
zh_hans: 模型数据缺失

source: The recommended Chinese grammar model is not active.
zh_hans: 推荐的中文语法模型当前未启用。

source: Install Long-tail Data
zh_hans: 安装长尾数据

source: Names, places, medical, technical, professional, and deep-tail dictionaries are active.
zh_hans: 人名、地名、医学、技术、专业与深层长尾词典已启用。

source: Install the optional long-tail dictionaries for maximum offline coverage.
zh_hans: 安装可选长尾词典，以获得最大的离线覆盖。

source: No compatible legacy data was found.
zh_hans: 未发现可兼容的旧数据。

source: Language data download
zh_hans: 语言数据下载

source: Retention limits apply to verified backups. Existing incomplete or invalid records are not removed automatically.
zh_hans: 保留上限适用于已验证备份；已有的未完成或无效记录不会被自动删除。

source: Long-tail data download
zh_hans: 长尾数据下载

source: Long-tail dictionaries
zh_hans: 长尾词典

source: No data-operation backups yet.
zh_hans: 尚无数据操作备份。

source: No completion timestamp
zh_hans: 无完成时间

source: Open Data Folder
zh_hans: 打开数据文件夹

source: Personal words, disabled words, Text Expander, and English interaction settings are preserved. An automatic backup is created first.
zh_hans: 个人词语、停用词、文本扩展和英文交互设置都会保留，并会先自动创建备份。

source: Data to export
zh_hans: 要导出的数据

source: Refresh
zh_hans: 刷新

source: Remove custom word
zh_hans: 移除自定义词语

source: Remove disabled word
zh_hans: 移除停用词

source: Remove text expansion
zh_hans: 移除文本扩展

source: Reports contain counts and versions, never words, learning rows, identity, or paths.
zh_hans: 报告只包含数量和版本，不包含词语、学习记录、身份或路径。

source: Reset learning data
zh_hans: 重置学习数据

source: Restore
zh_hans: 恢复

source: Retention
zh_hans: 备份保留

source: Reveal
zh_hans: 在访达中显示

source: Save…
zh_hans: 保存…

source: The verified backup replaces current data. The current state is backed up first.
zh_hans: 已验证备份将替换当前数据；当前状态会先自动备份。

source: A language-data update is available below. No logout is required.
zh_hans: 下方有可用的语言数据更新，无需注销。

source: Check Again
zh_hans: 重新检查

source: Checking for updates…
zh_hans: 正在检查更新…

source: Checking the running Core…
zh_hans: 正在检查运行中的核心…

source: Running Core
zh_hans: 正在运行的核心

source: Checking…
zh_hans: 正在检查…

source: Installed Core update is ready
zh_hans: 已安装的核心更新已就绪

source: Installed Core revision differs from the running Core
zh_hans: 已安装核心的内部版本与当前运行核心不同

source: The version and build are the same, but the installed source revision differs. You can keep using the running Core or apply the installed revision after switching away from Linnet.
zh_hans: 版本号和构建号相同，但已安装核心的源码版本不同。你可以继续使用当前核心，也可以先切换到其他输入法，再应用已安装的版本。

source: You can keep using the current Core, or apply the installed Core after switching away from Linnet. Other apps stay open and no logout is required.
zh_hans: 你可以继续使用当前核心，也可以先切换到其他输入法，再应用已安装的核心。其他应用会保持打开，无需注销。

source: Running
zh_hans: 正在运行

source: Installed
zh_hans: 已安装

source: Installed Core will start after one normal login
zh_hans: 已安装的核心将在一次正常登录后启动

source: This Core cannot verify every app released its old input connection, so this update cannot be applied now. After one normal macOS login or restart, later updates need no logout.
zh_hans: 当前核心无法确认所有应用都已释放旧输入连接，因此现在不能应用这次更新。正常登录 macOS 或重启一次后，后续更新无需注销。

source: Apply Installed Update…
zh_hans: 应用已安装的更新…

source: Applying installed Core…
zh_hans: 正在应用已安装的核心…

source: Keep another input source selected until Settings closes.
zh_hans: 在设置窗口关闭前，请保持选中其他输入法。

source: The installed Core is waiting
zh_hans: 已安装的核心正在等待

source: Try Apply Again…
zh_hans: 再次尝试应用…

source: Installed Core is now running
zh_hans: 已安装的新核心现已运行

source: Settings will close so its own connection can reopen cleanly.
zh_hans: 设置将关闭，以便其自身连接随后能够干净地重建。

source: This running Core cannot apply the update safely
zh_hans: 当前运行的核心无法安全应用更新

source: Keep using the current Core. After the next normal macOS login or restart, future Core updates can use Apply Now without another logout.
zh_hans: 请继续使用当前核心。下次正常登录 macOS 或重启后，未来的核心更新即可使用“立即应用”，无需再次注销。

source: The installed Core was not activated
zh_hans: 已安装的核心未能启用

source: Core activation could not be verified. Check the runtime before trying again.
zh_hans: 尚未确认核心更新已生效。请检查运行状态后再试。

source: The selected input source could not be read. Select another input source in the macOS input menu, then try again.
zh_hans: 暂时无法读取当前输入源。请在 macOS 输入菜单中切换到其他输入法后重试，无需注销。

source: Use the macOS input menu to select another input source, then try again.
zh_hans: 请通过 macOS 输入法菜单选择其他输入法，然后重试。

source: Finish or cancel the current composition, then try again.
zh_hans: 请先完成或取消当前输入，再重试。

source: Wait for the current data operation to finish, then try again.
zh_hans: 请等待当前数据操作完成，然后重试。

source: An unidentified app used this Host, so Linnet cannot prove that an immediate restart is safe. The update will remain installed for the next login or restart.
zh_hans: 有无法识别的应用使用过此 Host，因此 Linnet 无法证明立即重启是安全的。更新将保持已安装状态，并在下次登录或重启时生效。

source: Settings could not establish the one safe activation requester. Reopen Settings and try again.
zh_hans: 设置无法建立唯一的安全激活请求方。请重新打开设置后再试。

source: Apply the installed Core now?
zh_hans: 现在应用已安装的核心？

source: First use the macOS input menu to select another input source.
zh_hans: 请先使用 macOS 输入菜单切换到其他输入法。

source: Your apps stay open. Settings closes after the new Core is verified.
zh_hans: 其他应用会保持打开；新核心验证成功后，设置将关闭。

source: Apply Now
zh_hans: 立即应用

source: Check Runtime Again
zh_hans: 重新检查运行状态

source: Running Core identity is unavailable.
zh_hans: 无法获取正在运行核心的身份。

source: Run the Complete installer to repair Linnet before checking for updates.
zh_hans: 请先运行完整安装包修复 Linnet，再检查更新。

source: Updates do not stop the current Core or its app connections. The installed Core will run after the next macOS login or restart.
zh_hans: 更新不会停止当前核心或中断应用连接；已安装的新核心将在下次登录 macOS 或重启后运行。

source: Core update available
zh_hans: 有可用的核心更新

source: Downloading Core update
zh_hans: 正在下载核心更新
